app/controllers/api/v1/greetings_controller.rb

SELECT "greetings".* FROM "greetings" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def index
    @greeting = Greeting.order('RANDOM()').first

SELECT "greetings".* FROM "greetings" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def update
    @greeting = Greeting.order('RANDOM()').first